# Cleansing

In [1]:
# Importing Libraries
import pandas as pd
import numpy as np
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# Importing Data as a Dataframe
df = pd.read_csv("ds_salaries.csv")

# Previewing Data
df.sample(10)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
3100,2022,SE,FT,Data Engineer,170000,USD,170000,US,100,US,M
1620,2023,SE,FT,Data Scientist,153400,USD,153400,US,0,US,M
288,2023,SE,FT,Data Scientist,170000,USD,170000,US,0,US,M
2808,2022,SE,FT,Data Engineer,140000,USD,140000,US,100,US,M
1100,2023,SE,FT,Data Scientist,200160,USD,200160,US,0,US,M
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L
3381,2022,SE,FT,Data Analyst,69000,USD,69000,US,100,US,M
1308,2023,MI,FT,Machine Learning Engineer,36000,USD,36000,MX,100,MX,S
1712,2023,SE,FT,Data Scientist,135000,USD,135000,US,100,US,M
1078,2023,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M

We have 11 columns, including:
- 4 numerical column (work_year, salary, salary_in_usd, and remote_ratio)
- 7 categorical column (experience_level, employment_type, job_title, salary_currency, employee_residence, company_location, company_size)

## Data Type

In [3]:
# Checking Data Type
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

The datatype is correct

## Missing Values

In [4]:
# Checking Missing Values
df.isna().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [5]:
# Checking Null Values
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

No missing values, no null values.